#+AUTHOR:      Arnaud Legrand
#+TITLE:       Introduction to Linear Regression
#+DATE:        Performance Evaluation Lecture
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+STARTUP: beamer overview indent
#+TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel-style-preembule.tex}

#+LaTeX: \input{org-babel-document-preembule.tex}

*** Starting With a Simple Data Set
    *Descriptive statistics* provides simple summaries about the
    sample and about the observations that have been made.
    #+BEGIN_CENTER
       How could we summarize the following data set ?
    #+END_CENTER

#+BEGIN_SRC R :session :results none :exports none
library(ggplot2)
x=c(1, 2, 3, 5, 7, 9, 11, 13, 14, 15)
y=c(3, 1, 5, 2, 6, 4, 7, 9, 8, 5)
df=data.frame(x=x,y=y)
df_lines=data.frame(
          slope=c(.37,.67,.57,.41,.50,.385),intercept=c(2.0,-0.4,0.4,1.7,1.0,2.6),
          label=c("Least Squares \n (y~x)","Least Squares (x~y)", "Least Squares",
                 "Least Distance", "Least Rectangles", "Eyeball"),
          posx=c(16,15,13,5,3,8),
          posy=c(4.5,10,8,4,1,6),
          hjust=c(1,1,1,1,0,1),
          color=c("Least Squares","Least Squares","Least Squares x^2+y^2",
                  "Least Distance","Least Rectangles","Eyeball"))
#lm(data=df,y~x)
#lm(data=df,x~y)
#+END_SRC

#+LaTeX: \begin{tabular}[c]{cc} \fbox{

  #+BEGIN_SRC R :session :results output latex :exports results
  library(xtable)
  print(xtable(df),floating=FALSE)
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXPORT latex
  % latex table generated in R 3.0.2 by xtable 1.7-1 package
  % Thu Oct 31 13:30:32 2013
  \begin{tabular}{rrr}
    \hline
   & x & y \\ 
    \hline
  1 & 1.00 & 3.00 \\ 
    2 & 2.00 & 1.00 \\ 
    3 & 3.00 & 5.00 \\ 
    4 & 5.00 & 2.00 \\ 
    5 & 7.00 & 6.00 \\ 
    6 & 9.00 & 4.00 \\ 
    7 & 11.00 & 7.00 \\ 
    8 & 13.00 & 9.00 \\ 
    9 & 14.00 & 8.00 \\ 
    10 & 15.00 & 5.00 \\ 
     \hline
  \end{tabular}
  #+END_EXPORT

#+LaTeX: }& \hspace{1cm}\raisebox{-.5\height}{\resizebox{.5\linewidth}{!}{

  #+BEGIN_SRC R :session :exports none :results output graphics :file "./pdf_babel/scatterplot.pdf" :width 3 :height 3
  ggplot() + geom_point(data=df,aes(x=x,y=y),color="blue") + 
    xlim(0,16)+ylim(0,16)+ coord_fixed() + theme_bw()
  #+END_SRC

  #+RESULTS:
  [[file:./pdf_babel/scatterplot.pdf]]

  #+ATTR_LATEX: :width \linewidth :center nil
  [[file:./pdf_babel/scatterplot.pdf]]

#+LaTeX: }}\end{tabular}

*** Quick illustration of the difficulty of multiple testing
\small
#+begin_src R :results output :session :exports both
se = .1; mean = 7 ;
N = 10000;
df = data.frame(
    x1=rnorm(N,mean=mean,sd=se),
    x2=rnorm(N,mean=mean,sd=se),
    x3=rnorm(N,mean=mean,sd=se))
df$eq1 = abs(df$x1-mean)<2*se
df$eq2 = abs(df$x1-df$x2)<2*se
df$eq3 = abs(df$x1-df$x2)<2*se & 
         abs(df$x1-df$x3)<2*se & 
         abs(df$x2-df$x3)<2*se

mean(df$eq1)
mean(df$eq2)
mean(df$eq3)
#+end_src

#+RESULTS:
: [1] 0.9538
: [1] 0.8435
: [1] 0.6596

*** A simple ANOVA in R
\small
#+begin_src R :results output :session :exports both
d1_aov <- aov(Response ~ (A + B + C)^2, data=d1)
summary(d1_aov) # summary will call summary.aov
#+end_src

#+RESULTS:
#+begin_example
            Df Sum Sq Mean Sq F value   Pr(>F)    
A            1  22.98   22.98  38.318 0.000161 ***
B            1  68.02   68.02 113.417 2.11e-06 ***
C            1  77.60   77.60 129.402 1.21e-06 ***
A:B          1   0.44    0.44   0.728 0.415721    
A:C          1   0.93    0.93   1.555 0.243804    
B:C          1  14.62   14.62  24.374 0.000806 ***
Residuals    9   5.40    0.60                     
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
#+end_example

\medskip\normalsize
So, *all factors are significant* and there is *a significant
interaction between B and C*
*** Can't I just read my linear regression as usual?
\scriptsize

#+begin_src R :results output :session :exports both
summary.lm(d1_aov)
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response ~ (A + B + C)^2, data = d1)

Residuals:
     Min       1Q   Median       3Q      Max 
-1.01845 -0.48073 -0.01537  0.45886  0.98771 

Coefficients:
            Estimate Std. Error t value Pr(>|t|)    
(Intercept)  19.5912     0.1936 101.194 4.56e-15 ***
A1            1.1984     0.1936   6.190 0.000161 ***
B1            2.0618     0.1936  10.650 2.11e-06 ***
C1            2.2023     0.1936  11.375 1.21e-06 ***
A1:B1         0.1652     0.1936   0.853 0.415721    
A1:C1         0.2415     0.1936   1.247 0.243804    
B1:C1         0.9558     0.1936   4.937 0.000806 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.7744 on 9 degrees of freedom
Multiple R-squared:  0.9716,	Adjusted R-squared:  0.9527 
F-statistic:  51.3 on 6 and 9 DF,  p-value: 1.873e-06
#+end_example

#+BEGIN_EXPORT latex
\pause
\begin{overlayarea}{.6\linewidth}{0cm}
  \vspace{-7.3cm}
  \begin{block}{}
    \normalsize
    \centerline{Wait, why is the formula so different?} $$10 + 2A + 3BC$$
  \end{block}
\end{overlayarea}
\pause
\begin{overlayarea}{.6\linewidth}{0cm}
  \vspace{-2.3cm}
  \begin{block}{}
    \normalsize
    \begin{center}
       Because it treated the factors "-1" and "1" as $0$ and $1$...
    \end{center}
  \end{block}
\end{overlayarea}

#+END_EXPORT
*** Then how do I get the formula I expected? (1/2)
\small
#+begin_src R :results output :session :exports both
d1_lm <- lm(Response ~ (as.numeric(A) + as.numeric(B) + 
            as.numeric(C))^2, data=d1)
summary.aov(d1_lm)
#+end_src

#+RESULTS:
#+begin_example
                            Df Sum Sq Mean Sq F value   Pr(>F)    
as.numeric(A)                1  22.98   22.98  38.318 0.000161 ***
as.numeric(B)                1  68.02   68.02 113.417 2.11e-06 ***
as.numeric(C)                1  77.60   77.60 129.402 1.21e-06 ***
as.numeric(A):as.numeric(B)  1   0.44    0.44   0.728 0.415721    
as.numeric(A):as.numeric(C)  1   0.93    0.93   1.555 0.243804    
as.numeric(B):as.numeric(C)  1  14.62   14.62  24.374 0.000806 ***
Residuals                    9   5.40    0.60                     
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
#+end_example

\normalsize
Sweet, it's the same as the previous ANOVA
*** Then how do I get the formula I expected? (2/2)
\scriptsize
#+begin_src R :results output :session :exports both
summary(d1_lm) # summary will call summary.lm
#+end_src

#+RESULTS:
#+begin_example

Call:
lm.default(formula = Response ~ (as.numeric(A) + as.numeric(B) + 
    as.numeric(C))^2, data = d1)

Residuals:
     Min       1Q   Median       3Q      Max 
-1.01845 -0.48073 -0.01537  0.45886  0.98771 

Coefficients:
                            Estimate Std. Error t value Pr(>|t|)    
(Intercept)                  15.4654     3.1870   4.853 0.000905 ***
as.numeric(A)                -0.0429     1.6878  -0.025 0.980277    
as.numeric(B)                -2.6022     1.6878  -1.542 0.157516    
as.numeric(C)                -2.7789     1.6878  -1.647 0.134064    
as.numeric(A):as.numeric(B)   0.6606     0.7744   0.853 0.415721    
as.numeric(A):as.numeric(C)   0.9658     0.7744   1.247 0.243804    
as.numeric(B):as.numeric(C)   3.8232     0.7744   4.937 0.000806 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.7744 on 9 degrees of freedom
Multiple R-squared:  0.9716,	Adjusted R-squared:  0.9527 
F-statistic:  51.3 on 6 and 9 DF,  p-value: 1.873e-06
#+end_example

#+BEGIN_EXPORT latex
\pause
\begin{overlayarea}{.6\linewidth}{0cm}
  \vspace{-8.7cm}
  \begin{block}{}
    \begin{center}
      \normalsize Variability is too large too obtain good
      estimates of the \alert{true coefficients}\\[-2em]
      $$10 + 2A + 3BC$$

      \alert{One should anyway use other kind of designs to
         estimate continuous model parameters}
    \end{center}
  \end{block}
\end{overlayarea}
#+END_EXPORT
